results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg102400-tps1000-batch16384-acks1-prod12-compnone-trial2/producer-perf-10.log
producer_index=10
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 4017.0 ms avg latency, 4017.0 ms max latency.
56 records sent, 11.2 records/sec (1.09 MB/sec), 6664.7 ms avg latency, 15394.0 ms max latency.
144 records sent, 28.5 records/sec (2.79 MB/sec), 9780.4 ms avg latency, 11350.0 ms max latency.
186 records sent, 36.3 records/sec (3.54 MB/sec), 10973.8 ms avg latency, 12297.0 ms max latency.
154 records sent, 30.5 records/sec (2.98 MB/sec), 9286.6 ms avg latency, 10313.0 ms max latency.
156 records sent, 30.8 records/sec (3.00 MB/sec), 10489.2 ms avg latency, 11276.0 ms max latency.
348 records sent, 68.0 records/sec (6.64 MB/sec), 7561.8 ms avg latency, 11086.0 ms max latency.
432 records sent, 86.3 records/sec (8.43 MB/sec), 4178.0 ms avg latency, 4965.0 ms max latency.
521 records sent, 104.2 records/sec (10.17 MB/sec), 1992.6 ms avg latency, 3660.0 ms max latency.
405 records sent, 80.6 records/sec (7.87 MB/sec), 81.0 ms avg latency, 455.0 ms max latency.
399 records sent, 79.7 records/sec (7.78 MB/sec), 43.1 ms avg latency, 156.0 ms max latency.
358 records sent, 71.3 records/sec (6.97 MB/sec), 38.4 ms avg latency, 124.0 ms max latency.
385 records sent, 77.0 records/sec (7.52 MB/sec), 46.5 ms avg latency, 213.0 ms max latency.
387 records sent, 77.1 records/sec (7.53 MB/sec), 46.3 ms avg latency, 217.0 ms max latency.
415 records sent, 82.7 records/sec (8.08 MB/sec), 32.9 ms avg latency, 85.0 ms max latency.
399 records sent, 79.8 records/sec (7.79 MB/sec), 29.7 ms avg latency, 73.0 ms max latency.
401 records sent, 80.1 records/sec (7.82 MB/sec), 36.0 ms avg latency, 130.0 ms max latency.
408 records sent, 81.3 records/sec (7.94 MB/sec), 47.8 ms avg latency, 236.0 ms max latency.
416 records sent, 83.1 records/sec (8.12 MB/sec), 34.1 ms avg latency, 167.0 ms max latency.
420 records sent, 83.9 records/sec (8.19 MB/sec), 34.9 ms avg latency, 149.0 ms max latency.
422 records sent, 84.1 records/sec (8.22 MB/sec), 29.3 ms avg latency, 93.0 ms max latency.
422 records sent, 84.3 records/sec (8.24 MB/sec), 30.1 ms avg latency, 124.0 ms max latency.
409 records sent, 81.4 records/sec (7.95 MB/sec), 25.5 ms avg latency, 83.0 ms max latency.
464 records sent, 92.7 records/sec (9.06 MB/sec), 26.6 ms avg latency, 87.0 ms max latency.
8333 records sent, 62.354552 records/sec (6.09 MB/sec), 1513.16 ms avg latency, 15394.00 ms max latency, 40 ms 50th, 10137 ms 95th, 11086 ms 99th, 12008 ms 99.9th.